zephyrproject-rtos/zephyr/drivers/i3c/i3c_stm32.c
				if (*sclh_i2c <
				    DIV_ROUND_UP(STM32_I3C_SCLH_I2C_MIN_FM_NS * i3c_clock,
						 1000000000ull) -
					    1) {
					LOG_ERR("Cannot find a combination of SCLL_OD and SCLH_I2C "
						"at current I3C clock "
						"frequency for FM I2C bus");
					return -EINVAL;
				}
			} else {
				return -EINVAL;
			}
		} else {
			struct i3c_stm32_data *data = dev->data;
			uint64_t od_tlow_min_ns = MAX(data->drv_data.ctrl_config.scl_od_min.low_ns,
						      I3C_OD_TLOW_MIN_NS);

			/* Assume no I2C devices on the bus */
			*scll_od = DIV_ROUND_UP(od_tlow_min_ns * i3c_clock, 1000000000ull) - 1;
			*sclh_i2c = 0;
		}
	}

	LOG_DBG("TimingReg0: SCLL_OD = %d, SCLH_I2C = %d", *scll_od, *sclh_i2c);
	return 0;
}

static int i3c_stm32_calc_scll_pp_sclh_i3c(uint32_t i3c_bus_freq, uint32_t i3c_clock,
					   uint8_t *scll_pp, uint8_t *sclh_i3c, uint32_t min_sclh)
{
	*sclh_i3c = DIV_ROUND_UP((uint64_t)min_sclh * i3c_clock, 1000000000ull) - 1;
	*scll_pp = DIV_ROUND_UP(i3c_clock, i3c_bus_freq) - *sclh_i3c - 2;

	if (*scll_pp < DIV_ROUND_UP(STM32_I3C_SCLL_PP_MIN_NS * i3c_clock, 1000000000ull) - 1) {
		LOG_ERR("Cannot find a combination of SCLL_PP and SCLH_I3C at current I3C clock "
			"frequency for specified I3C bus speed");
		return -EINVAL;
	}

	LOG_DBG("TimingReg0: SCLL_PP = %d, SCLH_I3C = %d", *scll_pp, *sclh_i3c);
	return 0;
}

static int i3c_stm32_config_clk_wave(const struct device *dev)
{
	const struct i3c_stm32_config *cfg = dev->config;
	struct i3c_stm32_data *data = dev->data;
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	I3C_TypeDef *i3c = cfg->i3c;
	uint32_t i3c_clock = 0;
	uint32_t i2c_bus_freq = data->drv_data.ctrl_config.scl.i2c;
	uint32_t i3c_bus_freq = data->drv_data.ctrl_config.scl.i3c;
	/* Set kern_clk_idx = 1, if independent kernel clock is used */
	uint32_t kern_clk_idx = (cfg->pclk_len > 1) ? 1 : 0;
	int ret;

	ret = clock_control_get_rate(clk, (clock_control_subsys_t)&cfg->pclken[kern_clk_idx],
				     &i3c_clock);
	if (ret < 0) {
		LOG_ERR("Failed call clock_control_get_rate(pclken[%d])", kern_clk_idx);
		return -EIO;
	}

	uint8_t scll_od = 0;
	uint8_t sclh_i2c = 0;
	uint8_t scll_pp = 0;
	uint8_t sclh_i3c = 0;
	uint32_t clk_wave = 0;
	uint32_t sclh_i3c_min_ns;

	LOG_DBG("I3C Clock = %u, I2C Bus Freq = %u, I3C Bus Freq = %u", i3c_clock, i2c_bus_freq,
		i3c_bus_freq);

	ret = i3c_stm32_calc_scll_od_sclh_i2c(dev, i2c_bus_freq, i3c_clock, &scll_od, &sclh_i2c);
	if (ret != 0) {
		LOG_ERR("Cannot calculate the timing for TimingReg0, err=%d", ret);
		return ret;
	}

	/*
	 * A single SCLH_I3C field is shared by the Open-Drain and Push-Pull
	 * high phases. Program it from the strictest requirement: the larger
	 * of the OD and PP minimum high periods, but never below the hardware
	 * minimum. The hardware floor is required because i3c_bus_init() only
	 * raises the OD high period for the first broadcast and then restores
	 * the configured value, which may be lower than the STM32 minimum.
	 */
	sclh_i3c_min_ns = MAX(data->drv_data.ctrl_config.scl_od_min.high_ns,
			      data->drv_data.ctrl_config.scl_pp_min.high_ns);
	sclh_i3c_min_ns = MAX(sclh_i3c_min_ns, STM32_I3C_SCLH_I3C_MIN_NS);

	ret = i3c_stm32_calc_scll_pp_sclh_i3c(i3c_bus_freq, i3c_clock, &scll_pp, &sclh_i3c,
					      sclh_i3c_min_ns);
	if (ret != 0) {
		LOG_ERR("Cannot calculate the timing for TimingReg0, err=%d", ret);
		return ret;
	}

	clk_wave = ((uint32_t)sclh_i2c << 24) | ((uint32_t)scll_od << 16) |
		   ((uint32_t)sclh_i3c << 8) | (scll_pp);

	LOG_DBG("TimigReg0 = 0x%08x", clk_wave);

	LL_I3C_ConfigClockWaveForm(i3c, clk_wave);

	return 0;
}
#endif /*CONFIG_I3C_CONTROLLER*/

/**
 * @brief Get current configuration of the I3C hardware.
 *
 * @param[in] dev Pointer to controller device driver instance.
 * @param[in] type Type of configuration.
 * @param[in,out] config Pointer to the configuration parameters.
 *
 * @retval 0 If successful.
 * @retval -EIO General Input/Output errors.
 * @retval -ENOSYS If not implemented.
 */
static int i3c_stm32_config_get(const struct device *dev, enum i3c_config_type type, void *config)
{
	if (config == NULL) {
		return -EINVAL;
	}

	if (type == I3C_CONFIG_CONTROLLER) {
#ifdef CONFIG_I3C_CONTROLLER
		struct i3c_stm32_data *data = dev->data;

		(void)memcpy(config, &data->drv_data.ctrl_config,
			sizeof(data->drv_data.ctrl_config));
#else
		return -ENOTSUP;
#endif
	}

	if (type == I3C_CONFIG_TARGET) {
#ifdef CONFIG_I3C_TARGET
		const struct i3c_stm32_config *cfg = dev->config;
		I3C_TypeDef *i3c = cfg->i3c;
		struct i3c_config_target *config_target = config;

		(void)memset(config_target, 0, sizeof(*config_target));
		config_target->enabled = !ll_i3c_is_in_controller_mode(i3c);
		config_target->dynamic_addr =
			config_target->enabled ? LL_I3C_GetOwnDynamicAddress(i3c) : 0U;
		config_target->pid_random = (LL_I3C_GetIDTypeSelector(i3c) != 0U);
		config_target->pid = ((uint64_t)LL_I3C_GetMIPIManufacturerID(i3c) << 33);
		if (!config_target->pid_random) {
			config_target->pid |= ((uint64_t)LL_I3C_GetMIPIInstanceID(i3c) << 12);
		}
		config_target->bcr = (uint8_t)i3c->BCR;
		config_target->dcr = (uint8_t)LL_I3C_GetDeviceCharacteristics(i3c);
		config_target->max_read_len = (uint16_t)LL_I3C_GetMaxReadLength(i3c);
		config_target->max_write_len = (uint16_t)LL_I3C_GetMaxWriteLength(i3c);
#else
		return -ENOTSUP;
#endif
	}

	return 0;
}

#ifdef CONFIG_I3C_CONTROLLER
static uint8_t i3c_stm32_calc_free_timing(uint64_t min_ns, uint32_t i3c_clock)
{
	uint32_t cycles = min_ns * i3c_clock / 1000000000ULL;

	return (uint8_t)((cycles + 1) / 2);
}

static int i3c_stm32_configure_free_timing(const struct device *dev, uint32_t i3c_clock)
{
	const struct i3c_stm32_config *config = dev->config;
	uint8_t free_timing = 0;
	struct i3c_stm32_data *data = dev->data;
	uint32_t i2c_bus_freq = data->drv_data.ctrl_config.scl.i2c;
	I3C_TypeDef *i3c = config->i3c;

	if (i2c_bus_freq != 0) {
		if (i2c_bus_freq > 400000) {
			/* Mixed bus with I2C FM+ device */
			free_timing = i3c_stm32_calc_free_timing(STM32_I3C_TBUF_FMP_MIN_NS,
				i3c_clock);
		} else {
			/* Mixed bus with I2C FM device */
			free_timing = i3c_stm32_calc_free_timing(STM32_I3C_TBUF_FM_MIN_NS,
				i3c_clock);
		}
	} else {
		if (config->drv_cfg.dev_list.num_i2c > 0) {
			enum i3c_bus_mode mode = i3c_bus_mode(&config->drv_cfg.dev_list);

			if (mode == I3C_BUS_MODE_MIXED_FAST) {
				if (get_i3c_lvr_ic_mode(&config->drv_cfg.dev_list) ==
				    I3C_LVR_I2C_FM_MODE) {
					/* Mixed bus with I2C FM device */
					free_timing = i3c_stm32_calc_free_timing(
						STM32_I3C_TBUF_FM_MIN_NS,
						i3c_clock);
				} else {
					/* Mixed bus with I2C FM+ device */
					free_timing = i3c_stm32_calc_free_timing(
						STM32_I3C_TBUF_FMP_MIN_NS,
						i3c_clock);
				}
			} else {
				return -EINVAL;
			}
		} else {
			/* Pure I3C bus */
			free_timing = i3c_stm32_calc_free_timing(STM32_I3C_TCAS_MIN_NS, i3c_clock);
		}
	}
	LL_I3C_SetFreeTiming(i3c, free_timing);
	LL_I3C_SetDataHoldTime(i3c, LL_I3C_SDA_HOLD_TIME_1_5);
	return 0;
}
#endif /* CONFIG_I3C_CONTROLLER */

static int i3c_stm32_config_ctrl_bus_char(const struct device *dev, enum i3c_config_type type)
{
	const struct i3c_stm32_config *config = dev->config;
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	I3C_TypeDef *i3c = config->i3c;
	uint32_t i3c_clock = 0;
	uint8_t aval = 0;

	if (clock_control_get_rate(clk, (clock_control_subsys_t)&config->pclken[0], &i3c_clock) <
	    0) {
		LOG_ERR("Failed call clock_control_get_rate(pclken[0])");
		return -EIO;
	}

