zephyrproject-rtos/zephyr/drivers/i3c/i3c_stm32.c
	i3c_stm32_configure(dev, I3C_CONFIG_CONTROLLER, &data->drv_data.ctrl_config);
	i3c_stm32_controller_init(dev);

	/* Perform bus initialization only if there are devices that already exist on the bus */
	if (config->drv_cfg.dev_list.num_i3c > 0 &&
	    !(config->drv_cfg.flags & I3C_CONTROLLER_FLAG_DISABLE_BUS_INIT)) {
		ret = i3c_bus_init(dev, &config->drv_cfg.dev_list);
		if (ret != 0) {
			LOG_ERR("Failed to do i3c bus init, err=%d", ret);
			return ret;
		}
	}

#ifdef CONFIG_I3C_USE_IBI
	I3C_TypeDef *i3c = config->i3c;

	if (!(config->drv_cfg.flags & I3C_CONTROLLER_FLAG_DISABLE_HJ_AT_INIT)) {
		LL_I3C_EnableHJAck(i3c);
		data->hj_pm_lock = true;
		(void)pm_device_runtime_get(dev);
		pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	}
#endif

	return 0;
#else  /*CONFIG_I3C_CONTROLLER*/
	return -ENOTSUP;
#endif /*CONFIG_I3C_CONTROLLER*/
}

#ifdef CONFIG_I3C_TARGET
static void i3c_stm32_process_target_txfnf(const struct device *dev)
{
	struct i3c_stm32_data *data = dev->data;
	const struct i3c_stm32_config *config = dev->config;
	I3C_TypeDef *i3c = config->i3c;

	while (LL_I3C_IsActiveFlag_TXFNF(i3c)) {

		if (data->target_config != NULL && data->target_config->callbacks != NULL) {
			if (data->target_config->callbacks->read_processed_cb != NULL) {
				uint8_t byte = 0;

				data->target_config->callbacks->read_processed_cb(
					data->target_config, &byte);
				LL_I3C_TransmitData8(i3c, byte);
			}

			if (!LL_I3C_IsActiveTxPreload(i3c) &&
			    data->target_config->callbacks->read_requested_cb != NULL) {
				data->target_config->callbacks->read_requested_cb(
					data->target_config, NULL);
			}
		}
	}
}
#endif /*CONFIG_I3C_CONTROLLER*/

static void i3c_stm32_event_isr_tx(const struct device *dev)
{
	const struct i3c_stm32_config *config = dev->config;
	I3C_TypeDef *i3c = config->i3c;

#if CONFIG_I3C_TARGET
	if (!ll_i3c_is_in_controller_mode(i3c)) {
		i3c_stm32_process_target_txfnf(dev);
	}
#endif /*CONFIG_I3C_TARGET*/
#if CONFIG_I3C_CONTROLLER
	struct i3c_stm32_data *data = dev->data;

	switch (data->msg_state) {
	case STM32_I3C_MSG: {
		uint8_t *buf = NULL;
		size_t *offset = NULL;
		uint32_t len = 0;

		i3c_stm32_curr_msg_xfer_get_buf(dev, &buf, &len, &offset);

		if (i3c_stm32_fill_tx_fifo(dev, buf, len, offset)) {
			i3c_stm32_curr_msg_xfer_next(dev);
		}

		break;
	}
	case STM32_I3C_MSG_DAA: {
		struct i3c_device_desc *target;
		uint8_t bcr;
		uint8_t dcr;
		uint8_t dyn_addr = 0;
		int ret;

		bcr = (data->pid >> 8) & 0xFF;
		dcr = data->pid & 0xFF;
		data->pid >>= 16;

		/* Disable TXFNF interrupt, the RXFNE interrupt will enable it once all PID bytes
		 * are received for next I3C target, or in i3c_stm32_do_daa after frame complete
		 */
		LL_I3C_DisableIT_TXFNF(i3c);

		/* Find the device in the device list */
		ret = i3c_dev_list_daa_addr_helper(dev, data->pid, false, false, &target,
						   &dyn_addr);
		if (ret != 0) {
			/* TODO: figure out what is the correct sequence to exit form this error
			 * It is expected that a TX overrun error to occur which triggers err isr
			 */
			LOG_ERR("No dynamic address could be assigned to target");

			return;
		}

		/* Put the new dynamic address in TX FIFO for transmission */
		LL_I3C_TransmitData8(i3c, dyn_addr);

		if (target != NULL) {
			/* Update target descriptor */
			target->dynamic_addr = dyn_addr;
			target->bcr = bcr;
			target->dcr = dcr;

			int aret = i3c_attach_i3c_device(target);

			if (aret != 0 && aret != -EALREADY) {
				LOG_ERR("Failed to attach target");
			}
		}

		/* Mark the address as used */
		i3c_addr_slots_mark_i3c(&data->drv_data.attached_dev.addr_slots, dyn_addr);

		/* Mark the static address as free */
		if ((target != NULL) && (target->static_addr != 0) &&
		    (dyn_addr != target->static_addr)) {
			i3c_addr_slots_mark_free(&data->drv_data.attached_dev.addr_slots,
						 target->static_addr);
		}

		break;
	}
	case STM32_I3C_MSG_CCC: {
		struct i3c_ccc_payload *payload = data->ccc_payload;

		if (payload->ccc.num_xfer < payload->ccc.data_len) {
			LL_I3C_TransmitData8(i3c, payload->ccc.data[payload->ccc.num_xfer++]);
		}
		break;
	}
	case STM32_I3C_MSG_CCC_P2: {
		struct i3c_ccc_target_payload *target = data->ccc_target_payload;

		if (target->num_xfer < target->data_len) {
			LL_I3C_TransmitData8(i3c, target->data[target->num_xfer++]);

			/* After sending all bytes for current target, move on to the next target */
			if (target->num_xfer == target->data_len) {
				data->ccc_target_payload++;
			}
		}
		break;
	}
	default:
		break;
	}
#endif /*CONFIG_I3C_CONTROLLER*/
}

static void i3c_stm32_event_isr_rx(const struct device *dev)
{
	const struct i3c_stm32_config *config = dev->config;
	struct i3c_stm32_data *data = dev->data;
	I3C_TypeDef *i3c = config->i3c;

#ifdef CONFIG_I3C_TARGET
	if (LL_I3C_IsActiveFlag_RXFNE(i3c) && !ll_i3c_is_in_controller_mode(i3c)) {
		if (data->target_config && data->target_config->callbacks != NULL &&
		    data->target_config->callbacks->write_requested_cb != NULL) {
			data->target_config->callbacks->write_requested_cb(data->target_config);
		}

		while (LL_I3C_IsActiveFlag_RXFNE(i3c)) {
			uint8_t rx_data = LL_I3C_ReceiveData8(i3c);

			if (data->target_config && data->target_config->callbacks != NULL &&
			    data->target_config->callbacks->write_received_cb != NULL) {
				data->target_config->callbacks->write_received_cb(
					data->target_config, rx_data);
			}
		}
	}
#endif /*CONFIG_I3C_TARGET*/

#ifdef CONFIG_I3C_CONTROLLER
	switch (data->msg_state) {
	case STM32_I3C_MSG: {
		uint8_t *buf = NULL;
		size_t *offset = NULL;
		uint32_t len = 0;

		i3c_stm32_curr_msg_xfer_get_buf(dev, &buf, &len, &offset);
		if (i3c_stm32_drain_rx_fifo(dev, buf, len, offset)) {
			i3c_stm32_curr_msg_xfer_next(dev);
		}

		break;
	}
	case STM32_I3C_MSG_DAA: {
		data->pid <<= 8;
		data->pid |= LL_I3C_ReceiveData8(i3c);

		data->daa_rx_rcv++;

		/* After receiving 8 PID bytes from DAA, enable TXFNF interrupt to send the dynamic
		 * address
		 */
		if (data->daa_rx_rcv == 8) {
			LL_I3C_EnableIT_TXFNF(i3c);
			data->daa_rx_rcv = 0;
		}
		break;
	}
	case STM32_I3C_MSG_CCC_P2: {
		struct i3c_ccc_target_payload *target = data->ccc_target_payload;

		if (target->num_xfer < target->data_len) {
			target->data[target->num_xfer++] = LL_I3C_ReceiveData8(i3c);

			/* After receiving all bytes for current target, move on to the next target
			 */
			if (target->num_xfer == target->data_len) {
				data->ccc_target_payload++;
			}
		}
		break;
	}
	default:
		break;
	}
#endif /*CONFIG_I3C_CONTROLLER*/
}

#ifdef CONFIG_I3C_CONTROLLER
static void i3c_stm32_event_isr_cf(const struct device *dev)
{
	const struct i3c_stm32_config *config = dev->config;
	struct i3c_stm32_data *data = dev->data;
	struct i3c_stm32_msg *curr_msg = &data->curr_msg;
	I3C_TypeDef *i3c = config->i3c;

